:PROPERTIES:
:ID:       56cedcd7-e6e7-46b2-8935-fc5ffff689dd
:END:
#+title: python-function
#+startup: overview
#+filetags: :python:function:

*** for循环嵌套
#+begin_src python :results output
# 生成一个坐标表
grids = [(row, col) for row in range(3) for col in range(4)]
print(grids)

seats = []

# 外层循环：遍历每一行
for row in range(3):
    # 内层循环：遍历每一列
    for col in range(4):
        seat = (row, col)
        seats.append(seat)

print(seats)
#+end_src

#+RESULTS:
: [(0, 0), (0, 1), (0, 2), (0, 3), (1, 0), (1, 1), (1, 2), (1, 3), (2, 0), (2, 1), (2, 2), (2, 3)]
: [(0, 0), (0, 1), (0, 2), (0, 3), (1, 0), (1, 1), (1, 2), (1, 3), (2, 0), (2, 1), (2, 2), (2, 3)]

* 函数调用
#+begin_src
# 定义函数
def 函数名称([参数1, 参数2, ...]):
    函数体
    ...
    [return 返回值]

# 调用函数
函数名称(参数1, 参数2, ...)
#+end_src

#+begin_src python :results output
def size(num1, num2):
    jia = num1 + num2
    jian = num1 - num2
    cheng = num1 * num2
    chu = num1 / num2
    return jia, jian, cheng, chu


# 调用size方法
print(size(20, 5))
#+end_src

#+RESULTS:
: (25, 15, 100, 4.0)
** lambda函数
#+begin_src 
变量 = lambda 函数参数:表达式（函数代码 + return返回值）
# 调用变量
变量()
#+end_src
#+begin_src python :results output 
def func(str):
    return 'hello' + str

print(func(' world'))

fn = lambda str: 'hello' + str
print(fn(' world'))

fn = lambda num1, num2 = 20: num1 + num2
print(fn(1))

students = [
    {'name': 'Tom', 'age': 20},
    {'name': 'Rose', 'age': 19},
    {'name': 'Jack', 'age': 22}
]

students.sort(key=lambda x: x['age'], reverse=True)
print(students)
#+end_src

#+RESULTS:
: hello world
: hello world
: 21
